## 컴파일이란?

> 컴퓨터는 인간의 언어를 이해할 수 없다.
> 
- 인간은 고급언어로 프로그래밍 후 저급언어로 변환을 해야하는데, 이때 이루어지는 과정을 컴파일이라고 한다.
- **컴파일이란 사람이 이해하는 언어를 컴퓨터가 이해할 수 있는 언어로 바꿔주는 과정중 하나이다**

1. 인간이 고급언어로 코드를 작성한다
2. 컴파일러와 어셈블러를 이용하여 컴퓨터가 이해할 수 있는 언어로 변환한다
3. 컴퓨터가 번역된 코드를 읽고 실행한다

### 이렇게 변환하는 전체 과정을 '**컴파일'이라고 부르는것이 아닌 '빌드'라고 부른다.**

## **빌드(Build)란?**

> 빌드(Build)란 소스 코드 파일을 실행 가능한 소프트웨어 산출물로 변환하는 과정이다
> 
- 빌드 과정을 도와주는 도구가 Build Tool이다.
- 코딩을 하고 완성되면 run을 실행하여 결과를 화면에서 볼 수 있는데 이때 Build Tool에 의해 모든 빌드과정이 자동으로 실행된다.

<aside>

컴파일은 고급언어를 컴퓨터가 이해할 수 있는 저급언어로 바꿔주는 과정 중 하나일뿐 전체적인 과정을 뜻하는게 아니다. 즉, 빌드라는 변환 과정의 큰 틀안에서 동작하는 하나의 과정을 컴파일이라고 하고, 여러 과정이 합쳐진것이 빌드이다.

</aside>
